## Operations in Pandas

In [1]:
import numpy as np
import pandas as pd

In [5]:
df1 = pd.DataFrame\
(data={ 'col1':[1,2,3,4],\
        'col2':[44,55,66,44],\
        'col3':['abc','def','ghi','jkl']\
      }\
)

In [6]:
df1

   col1  col2 col3
0     1    44  abc
1     2    55  def
2     3    66  ghi
3     4    44  jkl

In [11]:
df1['col2'].unique()

array([44, 55, 66], dtype=int64)

In [13]:
print(df1['col2'].nunique())
print(len(df1['col2'].unique()))

3
3

In [15]:
df1['col2'].value_counts()

44    2
55    1
66    1
Name: col2, dtype: int64

We know conditional selection.
<code>
   df[(df['col1'>2]) & (df['col2'==444])]
</code>
will result in __only__ row 3 which matches both conditions.

#### Apply Method 
<code>.apply(**name of function**)</code>

In [16]:
def times2(x):
    return x*2

In [17]:
df1['col2'].sum()

209

In [18]:
df1['col2'].apply(times2)

0     88
1    110
2    132
3     88
Name: col2, dtype: int64

In [19]:
# MAPS the function
# eg. to calculate length of each string in a particular column.

In [20]:
df1['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [21]:
df1['col1'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [22]:
df1

   col1  col2 col3
0     1    44  abc
1     2    55  def
2     3    66  ghi
3     4    44  jkl

In [24]:
df1.sort_values(by='col2')

   col1  col2 col3
0     1    44  abc
3     4    44  jkl
1     2    55  def
2     3    66  ghi

In [25]:
df1.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [33]:
df1

   col1  col2 col3
0     1    44  abc
1     2    55  def
2     3    66  ghi
3     4    44  jkl

pivot_table ??